<template>
  <TheHomeMain />
  <HomeList :title="clientsTitle" :list="clientsList" />
  <HomeList :title="servicesTitle" :list="servicesList">логотипов и лекал</HomeList>
  <TheAdvantage />

  <section class="section section--works">
    <div class="container">
      <div class="section-inner">
        <div class="works-info">
          <h2 class="section-title">Наши работы</h2>
          <p>
            В этом альбоме вы можете увидеть<br />замечательные результаты наших
            трудов!
          </p>
          <a href="#photo" class="button">
            Перейти в альбом
            <svg viewBox="0 0 7.01 7.01" class="arrow-icon">
              <path d="M.32,3.51h6.38" />
              <path d="M3.51.32l3.19,3.19-3.19,3.19" />
            </svg>
          </a>
        </div>
      </div>
    </div>
  </section>
  <section class="section section--photos" id="PHOTO">
    <div class="container">
      <div class="section-inner"></div>
    </div>
  </section>
  <section class="section section--socials">
    <div class="container">
      <div class="section-inner">
        <h2 class="section-title">
          Открывайте<br />
          новые горизонты с нами
        </h2>
        <p>Свяжитесь с нами!</p>
        <p>Мы с радостью ответим на все ваши вопросы!</p>
        <button href="#links" class="button" data-form>
          Свяжитесь с нами
          <svg viewBox="0 0 7.01 7.01" class="arrow-icon">
            <path d="M.32,3.51h6.38" />
            <path d="M3.51.32l3.19,3.19-3.19,3.19" />
          </svg>
        </button>
        <div class="socials-list">
          <div class="socials-item">
            <a href="#" target="_blank">
              <svg viewBox="0 0 58 34" class="social-icon">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M28.3099 33.4702H31.7499C31.7499 33.4702 32.7699 33.34 33.2799 32.77C33.7899 32.26 33.7299 31.2402 33.7299 31.2402C33.7299 31.2402 33.6699 26.6498 35.7699 26.0098C37.8699 25.3698 40.5499 30.4101 43.4199 32.3901C45.5899 33.8601 47.2499 33.54 47.2499 33.54L54.8999 33.4102C54.8999 33.4102 58.9199 33.1498 56.9999 30.0298C56.8699 29.7698 55.9199 27.74 51.3299 23.46C46.5499 19 47.1899 19.7598 52.9199 12.0498C56.4299 7.3998 57.8299 4.52982 57.3799 3.31982C56.9299 2.16982 54.3799 2.49023 54.3799 2.49023L45.7699 2.5498C45.7699 2.5498 45.1299 2.49023 44.6899 2.74023C44.2399 3.00023 43.9199 3.62988 43.9199 3.62988C43.9199 3.62988 42.5799 7.25982 40.7299 10.3198C36.8999 16.8198 35.3699 17.1398 34.7399 16.7598C33.2699 15.7998 33.6599 13 33.6599 10.96C33.6599 4.64996 34.6199 2.03008 31.8099 1.33008C30.8499 1.07008 30.2199 0.950195 27.7899 0.950195C24.7299 0.950195 22.1199 0.949902 20.6499 1.6499C19.6899 2.1599 18.9299 3.18023 19.3699 3.24023C19.9399 3.30023 21.2199 3.56002 21.9199 4.52002C22.8099 5.73002 22.7499 8.41016 22.7499 8.41016C22.7499 8.41016 23.2599 15.8098 21.5399 16.7598C20.3899 17.3998 18.7999 16.1199 15.3599 10.1899C13.6399 7.18994 12.2999 3.81006 12.2999 3.81006C12.2999 3.81006 12.0399 3.1701 11.5999 2.8501C11.0299 2.4701 10.2599 2.33984 10.2599 2.33984L2.09986 2.3999C2.09986 2.3999 0.889888 2.46021 0.439888 2.97021C0.0598878 3.42021 0.37989 4.43994 0.37989 4.43994C0.37989 4.43994 6.7599 19.4202 14.0199 26.9502C20.7099 33.9002 28.2999 33.4502 28.2999 33.4502L28.3099 33.4702Z"
                />
              </svg>
            </a>
          </div>
          <div class="socials-item">
            <a href="#" target="_blank">
              <svg viewBox="0 0 46 47" class="social-icon">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M23.3701 0.5C10.9401 0.5 0.930115 10.5699 0.930115 22.9399C0.930115 27.2099 2.08011 31.16 4.18011 34.54L0.100098 46.5898L12.5302 42.6401C15.7802 44.4301 19.4801 45.4502 23.3701 45.4502C35.8001 45.4502 45.8801 35.3798 45.8801 23.0098C45.8801 10.5798 35.8101 0.5 23.3701 0.5ZM23.3701 41.6899C19.5401 41.6899 16.0401 40.5398 13.1101 38.5698L5.9101 40.8599L8.27014 33.9102C6.04014 30.8502 4.70013 27.0199 4.70013 22.9399C4.70013 12.6099 13.1201 4.25977 23.3801 4.25977C33.6401 4.25977 42.0601 12.6799 42.0601 22.9399C42.1201 33.2699 33.7101 41.6899 23.3801 41.6899H23.3701ZM33.9501 28.0498C33.3801 27.7298 30.6301 26.2598 30.1201 26.0098C29.6101 25.8198 29.2301 25.69 28.8401 26.27C28.4501 26.85 27.3101 28.0599 26.9301 28.4399C26.6101 28.8199 26.2301 28.8198 25.6501 28.5698C25.0801 28.2498 23.2901 27.6098 21.1201 25.5698C19.4601 23.9798 18.3801 22.0602 18.0601 21.4902C17.7401 20.9202 18.0601 20.5998 18.3801 20.3398C18.6401 20.0798 18.9501 19.6999 19.2701 19.3799C19.5901 19.0599 19.6501 18.8099 19.9101 18.4199C20.1001 18.0399 20.0401 17.7199 19.9101 17.3999C19.7801 17.0799 18.7601 14.2101 18.3201 13.0601C17.8701 11.9101 17.4301 12.04 17.0401 12.04C16.7201 12.04 16.3401 11.98 15.9601 11.98C15.5801 11.98 14.9401 12.1101 14.4301 12.6201C13.8601 13.1901 12.3301 14.5298 12.2601 17.3398C12.1301 20.1498 14.1101 22.9501 14.3601 23.3301C14.6201 23.7101 18.0601 29.8299 23.8601 32.3799C29.6001 34.8699 29.6601 34.1001 30.6801 34.1001C31.7601 34.0401 34.1201 32.8198 34.6301 31.5498C35.1401 30.2098 35.2001 29.0601 35.0801 28.8101C34.8201 28.5501 34.4401 28.36 33.9301 28.04L33.9501 28.0498Z"
                />
              </svg>
            </a>
          </div>
          <div class="socials-item">
            <a href="#" target="_blank">
              <svg viewBox="0 0 48 41" class="social-icon">
                <path
                  d="M44.7399 0.560037L1.95989 16.75C-0.400113 17.45 -0.340123 19.7498 1.44988 20.3198L12.1598 23.6401L16.2399 36.2002C16.7499 37.6002 17.1299 38.1098 18.0299 38.1098C18.9299 38.1098 19.2399 37.7899 20.1999 36.9599C21.2799 35.9399 22.9399 34.3498 25.5599 31.7998L36.7198 40.02C38.7598 41.17 40.2299 40.5898 40.7399 38.1098L47.7499 3.49021C48.5099 0.560213 46.7299 -0.339963 44.7499 0.560037H44.7399ZM13.8199 22.8701L38.1698 7.5698C39.3798 6.7398 39.7599 7.63 39.1899 8.27L18.9798 26.5L17.9599 35.6201L13.8199 22.8701Z"
                />
              </svg>
            </a>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import TheHomeMain from "../components/TheHomeMain.vue"
import HomeList from "../components/HomeList.vue"
import TheAdvantage from "../components/TheAdvantage.vue"

export default {
  components: {
    TheHomeMain,
    HomeList,
    TheAdvantage
  },

  data() {
    return {
      clientsTitle: 'Кому <br>мы полезны',
      servicesTitle: 'Наши услуги',
      clientsList: [
        { text: 'Бренды и дизайнеры детской одежды' },
        { text: 'Организаторы мероприятий и кружков' },
        { text: 'Детские сады и школы' },
        { text: 'Корпаративные клиенты' },
        { text: 'Начинающие предприниматели' }
      ],
      servicesList: [
        { text: 'Производство одежды (от 5 единиц)' },
        { text: 'Разработка, создание образцов' },
        { text: 'Разработка дизайна и коллекций' },
        { text: 'Конструирование и градация лекал' },
        { text: 'Разработка печать и нанесение' },
      ]
    }
  }
}
</script>
