export default {
  firstList: [
    {
      title: 'Разработка дизайна',
      description: `Создание индвидуальных эскизов одежды с учетом
        ваших предпочтений и современных тенденций.`,
    },
    {
      title: 'Подбор тканей и материалов',
      description: `Мы поможем вам выбрать качественные ткани. Также предложим подходящую
        фурнитуру и акссесуары, которые подчеркнут индивидуальность изделий.`,
    },
    {
      title: 'Расчет расходных материалов',
      description: `Мы составляем точный расчет необходимых материалов, что бы избежать
        лишних затрат и обеспечить оптимальный процесс производства.`,
    },
    {
      title: 'Сопровождение производства',
      description: `Мы контроллируем весь процесс изготовления, от первых образцов до
        финального выпуска продукции.`,
    },
  ],

  secondaryList: [
    {
      title: 'Создание лекал с нуля',
      description: `Мы разрабатываем лекала на основе ваших эскизов или образцов, с
            учетом особенностей кроя и возрастных характеристик. Вы получите
            готовые лекала, которые можно сразу использовать для массового или
            индивидуального проекта.`,
    },
    {
      title: 'Корректировка и доработка готовых лекал',
      description: `Если у вас уже есть базовые лекала, но требуется их изменение, наши
            специалисты внесут необходимые корректировки для улучшения посадки
            или адаптации под новые размеры.`,
    },
    {
      title: 'Градация размеров',
      description: `Мы можем создать полный размерный ряд для каждой модели, чтобы
            изделия идеально подходили детям разного возраста и комплекции.`,
    },
    {
      title: 'Оптимизация расхода ткани',
      description: `Мы учитываем рациональный расход ткани при создании лекал, что
            позволяет экономить материалы без ущерба для качества готового
            изделия`,
    },
  ],

  thirdList: [
    {
      title: 'Производство первого образца по вашим лекалам',
      description: `Мы создадим образец по готовым лекалам, чтобы вы могли оценить
            конечный результат. Если у вас нет лекал, наши специалисты помогут разработать их с нуля.`,
    },
    {
      title: 'Оценка посадки и удобства',
      description: `Образец даст возможность протестировать, как изделие сидит на ребёнке, оценить уровень комфорта и соответствие размерам.`,
    },
    {
      title: 'Тестирование материалов и фурнитуры',
      description: `Мы используем выбранные вами ткани и фурнитуру для создания образца, чтобы убедиться, что они соответствуют ожиданиям по качеству, износостойкости и внешнему виду.`,
    },
    {
      title: 'Корректировка и доработка',
      description: `После создания образца мы можем внести любые необходимые изменения в дизайн, лекала или материалы, чтобы довести изделие до идеала перед серийным производством.`,
    },
    {
      title: 'Демонстрация конечного изделия',
      description: `Вы сможете увидеть и протестировать готовый образец, чтобы убедиться в том, что все детали учтены и модель полностью соответствует вашим ожиданиям.`,
    },
  ],

  fourthList: [
    {
      title: 'Производство по готовым лекалам или создание лекал',
      description: `Мы можем работать как с вашими готовыми лекалами, так и предложить услугу их разработки. Все лекала будут точно соответствовать вашим требованияк к посадке и дизайну.`,
    },
    {
      title: 'Подбор тканей и фурнитуры',
      description: `Мы поможем подобрать качественные материалы и фурнитуру`,
    },
    {
      title: 'Точный расчет расхода материалов',
      description: `Наши специалисты составят точный расчет необходимых материалов для вашей партии, что позволит избежать перерасхода и оптимизировать стоимость производства.`,
    },
    {
      title: 'Контроль качества на каждом этапе',
      description: `Мы контролируем весь процесс производства, начиная от раскроя и заканчивая упаковкой готовых изделий.`,
    },
    {
      title: 'Гибкие условия заказа',
      description: `Мы предлагаем удобные условия пошива, начиная от небольших партий (от 5 единиц) и заканчивая крупносерийным производством. Независимо от объёма заказа, мы гарантируем внимательное отношение к деталям.`,
    },
  ],

  fifthList: [
    {
      title: 'Выездной замер',
      description: `Профессиональные конструкторы и портные снимут точные мерки с вашего ребенка, учитывая все особенности фигуры и возрастные параметры.`,
    },
    {
      title: 'Примерка на дому',
      description: `Мы привезем готовую одежду для примерки или несколько вариантов моделей. Вы сможете оценить, как изделия сидят на ребёнке, а наши специалисты внесут все необходимые корректировки на месте.`,
    },
    {
      title: 'Консультация по стилю и фасону',
      description: `При замерах и примерках вы получите консультации по выбору моделей, фасонов и тканей, чтобы результат соответствовал вашим ожиданиям. Мы подскажем, как лучше подобрать материалы для различных сезонов и мероприятий.`,
    },
    {
      title: 'Корректировака по результатам примерки',
      description: `Если после примерки потребуется внести изменения в крой или детали изделия, мы быстро учтем все пожелания и доработаем модель. Повторные примерки также могут быть организованы на дому.`,
    },
  ],

  sixthList: [
    {
      title: 'Индивидуальный дизайн принтов',
      description: `Наши дизайнеры разработают оригинальные макеты с учетом ваших пожеланий и стиля коллекции.`,
    },
    {
      title: 'Подбор цветовой гаммы и графических элементов',
      description: `Мы тщательно подберем цветовую палитру и графику для печати, чтобы макеты идеально сочетались с выбранными тканями и моделями одежды.`,
    },
    {
      title: 'Подгтовка макетов к печати',
      description: `Мы создаем макеты в высоком разрешении и готовим их в формате удобном для любого типа печати (шелкография, сублимация, термоперенос и другие).`,
    },
    {
      title: 'Корректировака и финальная проверка',
      description: `Перед передачей макета в печать мы согласуем с вами все детали и при необходимости внесем правки, чтобы результат точно соответствовал вашим ожиданиям.`,
    },
    {
      title: 'Консультация по материалам и методам печати',
      description: `Мы подскажем, какие материалы и технологии лучше всего подойдут для реализации макета на ткани, чтобы обеспечить долговечность и яркость рисунка.`,
    },
  ],
}
